/*
SQLyog Community v13.2.1 (64 bit)
MySQL - 8.0.35 : Database - my_db
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`my_db` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `my_db`;

/*Table structure for table `product` */

DROP TABLE IF EXISTS `product`;

CREATE TABLE `product` (
  `id` int NOT NULL,
  `name` varchar(50) DEFAULT NULL,
  `price` int DEFAULT NULL,
  `description` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `stock` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

/*Data for the table `product` */

insert  into `product`(`id`,`name`,`price`,`description`,`stock`) values 
(1,'มีดครัว',500,'สำหรับหั่นวัตถุดิบ',10),
(2,'หม้อสแตนเลส',600,'ใช้สำหรับต้ม',15),
(3,'กระทะเหล็ก',899,'ใช้ทอด',8),
(4,'หม้อต้มสองหู',575,'ต้มวัตถุดิบต่างๆ',15),
(5,'หม้อด้ามอิมแพค',750,'ต้มวัตถุดิบ',8),
(6,'กระทะด้ามมาราธอน',620,'ทอดแบบไร้น้ำมัน',9),
(7,'กระทะด้าม กลาดิเอเตอร์ ',725,'ทอดแบบไร้น้ำมัน',8),
(8,'กระทะย่างสี่เหลี่ยม',1075,'ทอดแบบไร้น้ำมัน',8),
(9,'กระทะย่างรีดน้ำมัน ',1320,'ทอดแบบขนาดใหญ่',11),
(10,'กระทะย่างนอนสติ๊ก',1690,'ทอดแบบขนาดใหญ่',9),
(11,'กระทะย่างอัลทิเมท',2225,'ทอดไร้น้ำมัน',3),
(12,'กระทะด้ามทอดไข่',360,'สำหรับทอดไข่',6),
(13,'หม้อพร้อมชั้นนึ่ง',450,'ต้มพร้อมนึ่งอาหาร',4),
(14,'กระทะด้ามหู',625,'ทอดอาหาร',6),
(15,'กระทะด้ามทรงตื้น ',325,'ทอดอาหา',7),
(16,'กระทะจีน 3 ชั้น',1530,'ทอดอาหาร',10),
(17,'กระทะด้ามทรงลึก',435,'ใช้ทอดอาหารที่ต้องการ',9),
(18,'กระทะจีนซีกัล',750,'ทอดอาหาร ไร้น้ำมัน',5),
(19,'กระบวย 4 นิ้ว-ด้ามไม้',50,'ตักอาหาร',15),
(20,'กระบวยตักซุป',60,'ตักน้ำซุป',17),
(21,'ทัพพีเล็ก ด้ามดำ ',30,'ตักอาหา',6),
(22,'ทัพพีแขก',30,'ตักอาหารตักข้าว',16),
(23,'ทีพพี่ ไม้สัก',75,'ตักอาหาร',13),
(24,'กระบวยปากนกสเตนเลส',65,'ตักน้ำซุป',2),
(25,'กระบวยมีรูด้ามสเตนเลส',50,'ตักอาหารแห้ง',6),
(26,'กระบวยตักซุปในครัว',849,'ตักน้ำซุปในครัว',3),
(27,'ตะหลิวกลาง-ด้ามไม้',35,'ผัดอาหาร',6),
(28,'ตะหลิวกรอง',77,'ตักอาแบบแห้ง',9),
(29,'ตะหลิวกรองดีลักซ์',100,'ตักอาแบบแห้ง',9),
(30,'ที่ตักสปาเก็ตตี้ด้ามสเตนเลส ',356,'ตักสปาเก็ตตี้',8),
(31,'ที่ลวกก๋วยเตี๋ยว',228,'ลวกก๋วยเตี๋ยว',1),
(32,'ที่ลวกก๋วยเตี๋ยวด้ามไม้',485,'ลวก',2),
(33,'ที่ทุบเนื้อ',190,'ทุบเนื้อ',6),
(34,'ตะกร้าล้างผัก',260,'ล้างผัก',7),
(35,'ตะแกรงพักของทอด',576,'พักของที่เพิ่งทอดเสร็จ',1),
(36,'ที่วัดอุณหุภูมิอาหารแบบดิจิตอล',265,'วัดอุณหภูมิอาหาร',4);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
